#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************
* 创建播放器
*
* 传入参数：
*
* _sampleRateInHz为44100
* _channel为单声道，1为单声道，2为立体声
* _audioFormat为一个信号的bit数，单声道为16
* _bufferSize为内部所使用的缓冲区大小
*
* 传出参数：
*
* **_pplay 指向用户句柄的指针
*
* 返回值：
*
*  0 成功   -1 失败
************************************************************************/
int LT_voiceCreatePlayer(int _sampleRateInHz, int _channel, int _audioFormat, int _bufferSize, void **_pplay);

/************************************************************************
* 开始播放
*
* 返回值 0 成功   -1 失败
************************************************************************/
int LT_voiceStartPlay(void *_player);

/************************************************************************
* 停止播放，需同步返回（销毁函数是真正停止后才能释放内存）
**
* 返回值 0 成功   -1 失败
************************************************************************/
int LT_voiceStopPlay(void *_player);

/************************************************************************
* 把播放数据不停的写入播放器
* _audioData为cretePlayer时指定的音频数据格式的数据
* _dataLen为需播放的音频数据长度
*
* 返回值 0 成功   -1 失败
************************************************************************/
int LT_voiceWritePlayer(void *_player, char *_audioData, int _dataLen);

/*
* 返回值 0 成功   -1 失败*/
int LT_voiceFlushPlayer(void *_player);

/************************************************************************
* 释放播放器资源
*
* 返回值 0 成功   -1 失败
************************************************************************/
int LT_voiceReleasePlayer(void *_player);

#ifdef __cplusplus
}
#endif
