/*******************************************************************************
 *
 * Copyright (c)
 *
 *  \file search_ipc.h
 *
 *  \brief search ipc for product test tool.
 *
 *   create version  v 1.0.0  wangguixing
 *
 ******************************************************************************/

#ifndef _SEARCH_IPC_H_
#define UPGRADE_PORT         16888
#define SEARCH_PORT_NEW   9095
#define _SEARCH_IPC_H_

/* ========================================================================== */
/*                             Include Files                                  */
/* ========================================================================== */

/* None */

#ifdef __cplusplus
extern "C" {
#endif




/* ========================================================================== */
/*                          Function Declarations                             */
/* ========================================================================== */

/******************************************************************************
 * 函数介绍:  用于监听并处理生成测试工具和批量生产工具
 * 输入参数:  无
 * 输出参数:  无
 * 返回值      : 0   : success
 *                           <0 : error
 *                               v1.0.0    2015.09.09  wangguixing
 *****************************************************************************/
int search_daemon_init(void);


/******************************************************************************
 * 函数介绍:  退出生产测试程序和生成批量工具
 * 输入参数:  无
 * 输出参数:  无
 * 返回值      : 0   : success
 *                           <0 : error
 *                               v1.0.0    2015.09.09  wangguixing
 *****************************************************************************/
int search_daemon_exit(void);


#ifdef __cplusplus
}
#endif

#endif /* #ifndef _SEARCH_IPC_H_ */

